package day09;

public class BaseballManager {

	public static void main(String[] args) {
		/*숫자 야구게임을 플레이 한 후, 기록을 저장하는 프로그램을 작성하세요.
		 * 메뉴
		 * 1. 플레이
		 * 2. 기록확인
		 * 3. 종료
		 * 메뉴 선택 : 2
		 * 1. 홍길동 2회
		 * 2. 임꺽정 3회
		 * 3. 이몽룡 3회
		 * 4. 춘향이 4회
		 * 
		 * */
		
		//메뉴 출력
		
		//메뉴 선택
		
		//선택한 메뉴에 따른 기능 실행
			//1. 플레이
				//컴퓨터가 랜덤으로 숫자 생성
				
				//사용자가 숫자 입력
				
				//판별
				
				//3S = 종료
		
				//[new] 횟수를 기록 (최대 5등) 5등 기준으로 회수가 동일한 경우
				//기록갱신시 이름기록
				//먼저 플레이한 사용자 기록을 유지
				
		
			//2. 기록확인
				//등록된 5위까지의 기록을 확인
				
			//3. 종료
	}			

}
