package day09;

public class note {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}



/*참조변수 vs 일반변수(기본자료형으로 만들어진변수)
 *-일반변수: 기본자료형으로 만들어진 변수
 *-참조변수: 기본자료형이아닌것들로 만들어진것, 배열, 객체(string)등
 *-매개변수: 메소드를 실행하기 위해 필요한 정보를 전달하는 변수
 *-인자: 메소드를 실행하기 위해 실제 전달하는 값.
 *-지역변수: 메소드 안에서 선언되어서 사용되는 변수
 *-멤버변수(필드): 클래스 안에 선언하는 변수
 *	-인스턴스 필드
 *	-클래스 필드 
 *메소드: [하나의] 기능을 하도록 모아놓은 코드
 *	-재사용을 통해 코드의 길이를 줄임
 *	-기능의 유지보수를 쉽게 하기 위해
 *	-구조를 쉽게 파악가능.
 *메소드 오버로딩: 동일한 메소드가 여러개 있는것
 *	-매개변수가 다른 경우: 종류, 개수
 *	-같은 이름으로 같은 기능을 실행하는데 매개변수의 종류를 다양하게 만들 수 있다
 *=> 편리
 *가변인자 => 매개변수의 개수가 미정
 *
 *클래스
 *-생성자: 필드를 초기화
 *-메소드: 기능
 *-필드(멤버변수): 정보
 *	=> 클래스를 통해 필드를 편리하게 관리하고, 필요한 기능을 구현하여 사용
 *
 **/